OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1011/MIMXRT1011.h
/*******************************************************************************
 * Definitions
*******************************************************************************/

/*!
 * @brief Enumeration for the IOMUXC SW_PAD_CTL_PAD
 *
 * Defines the enumeration for the IOMUXC SW_PAD_CTL_PAD collections.
 */
typedef enum _iomuxc_sw_pad_ctl_pad
{
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_14 = 0U,        /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_13 = 1U,        /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_12 = 2U,        /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_11 = 3U,        /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_10 = 4U,        /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_09 = 5U,        /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_08 = 6U,        /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_07 = 7U,        /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_06 = 8U,        /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_05 = 9U,        /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_04 = 10U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_03 = 11U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_02 = 12U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_01 = 13U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_AD_00 = 14U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_14 = 15U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_13 = 16U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_12 = 17U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_11 = 18U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_10 = 19U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_09 = 20U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_08 = 21U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_07 = 22U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_06 = 23U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_05 = 24U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_04 = 25U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_03 = 26U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_02 = 27U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_01 = 28U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_SD_00 = 29U,       /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_13  = 30U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_12  = 31U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_11  = 32U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_10  = 33U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_09  = 34U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_08  = 35U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_07  = 36U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_06  = 37U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_05  = 38U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_04  = 39U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_03  = 40U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_02  = 41U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_01  = 42U,         /**< IOMUXC SW_PAD_CTL_PAD index */
    kIOMUXC_SW_PAD_CTL_PAD_GPIO_00  = 43U,         /**< IOMUXC SW_PAD_CTL_PAD index */
} iomuxc_sw_pad_ctl_pad_t;

/* @} */

/*!
 * @brief Enumeration for the IOMUXC select input
 *
 * Defines the enumeration for the IOMUXC select input collections.
 */
typedef enum _iomuxc_select_input
{
    kIOMUXC_USB_OTG_ID_SELECT_INPUT = 0U,          /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_PWMA_SELECT_INPUT_0 = 1U,     /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_PWMA_SELECT_INPUT_1 = 2U,     /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_PWMA_SELECT_INPUT_2 = 3U,     /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_PWMA_SELECT_INPUT_3 = 4U,     /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_PWMB_SELECT_INPUT_0 = 5U,     /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_PWMB_SELECT_INPUT_1 = 6U,     /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_PWMB_SELECT_INPUT_2 = 7U,     /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_PWMB_SELECT_INPUT_3 = 8U,     /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI_DQS_FA_SELECT_INPUT = 9U,      /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI_DQS_FB_SELECT_INPUT = 10U,     /**< IOMUXC select input index */
    kIOMUXC_KPP_COL_SELECT_INPUT_0  = 11U,         /**< IOMUXC select input index */
    kIOMUXC_KPP_COL_SELECT_INPUT_1  = 12U,         /**< IOMUXC select input index */
    kIOMUXC_KPP_COL_SELECT_INPUT_2  = 13U,         /**< IOMUXC select input index */
    kIOMUXC_KPP_COL_SELECT_INPUT_3  = 14U,         /**< IOMUXC select input index */
    kIOMUXC_KPP_ROW_SELECT_INPUT_0  = 15U,         /**< IOMUXC select input index */
    kIOMUXC_KPP_ROW_SELECT_INPUT_1  = 16U,         /**< IOMUXC select input index */
    kIOMUXC_KPP_ROW_SELECT_INPUT_2  = 17U,         /**< IOMUXC select input index */
    kIOMUXC_KPP_ROW_SELECT_INPUT_3  = 18U,         /**< IOMUXC select input index */
    kIOMUXC_LPI2C1_HREQ_SELECT_INPUT = 19U,        /**< IOMUXC select input index */
    kIOMUXC_LPI2C1_SCL_SELECT_INPUT = 20U,         /**< IOMUXC select input index */
    kIOMUXC_LPI2C1_SDA_SELECT_INPUT = 21U,         /**< IOMUXC select input index */
    kIOMUXC_LPI2C2_SCL_SELECT_INPUT = 22U,         /**< IOMUXC select input index */
    kIOMUXC_LPI2C2_SDA_SELECT_INPUT = 23U,         /**< IOMUXC select input index */
    kIOMUXC_LPSPI1_PCS_SELECT_INPUT_0 = 24U,       /**< IOMUXC select input index */
    kIOMUXC_LPSPI1_SCK_SELECT_INPUT = 25U,         /**< IOMUXC select input index */
    kIOMUXC_LPSPI1_SDI_SELECT_INPUT = 26U,         /**< IOMUXC select input index */
    kIOMUXC_LPSPI1_SDO_SELECT_INPUT = 27U,         /**< IOMUXC select input index */
    kIOMUXC_LPSPI2_PCS_SELECT_INPUT_0 = 28U,       /**< IOMUXC select input index */
    kIOMUXC_LPSPI2_SCK_SELECT_INPUT = 29U,         /**< IOMUXC select input index */
    kIOMUXC_LPSPI2_SDI_SELECT_INPUT = 30U,         /**< IOMUXC select input index */
    kIOMUXC_LPSPI2_SDO_SELECT_INPUT = 31U,         /**< IOMUXC select input index */
    kIOMUXC_LPUART1_RXD_SELECT_INPUT = 32U,        /**< IOMUXC select input index */
    kIOMUXC_LPUART1_TXD_SELECT_INPUT = 33U,        /**< IOMUXC select input index */
    kIOMUXC_LPUART2_RXD_SELECT_INPUT = 34U,        /**< IOMUXC select input index */
    kIOMUXC_LPUART2_TXD_SELECT_INPUT = 35U,        /**< IOMUXC select input index */
    kIOMUXC_LPUART3_RXD_SELECT_INPUT = 36U,        /**< IOMUXC select input index */
    kIOMUXC_LPUART3_TXD_SELECT_INPUT = 37U,        /**< IOMUXC select input index */
    kIOMUXC_LPUART4_RXD_SELECT_INPUT = 38U,        /**< IOMUXC select input index */
    kIOMUXC_LPUART4_TXD_SELECT_INPUT = 39U,        /**< IOMUXC select input index */
    kIOMUXC_NMI_GLUE_NMI_SELECT_INPUT = 40U,       /**< IOMUXC select input index */
    kIOMUXC_SPDIF_IN1_SELECT_INPUT  = 41U,         /**< IOMUXC select input index */
    kIOMUXC_SPDIF_TX_CLK2_SELECT_INPUT = 42U,      /**< IOMUXC select input index */
    kIOMUXC_USB_OTG_OC_SELECT_INPUT = 43U,         /**< IOMUXC select input index */
    kIOMUXC_XEV_GLUE_RXEV_SELECT_INPUT = 44U,      /**< IOMUXC select input index */
} iomuxc_select_input_t;

typedef enum _xbar_input_signal
{
    kXBARA1_InputRESERVED0          = 0|0x100U,    /**< XBARA_IN0 input is reserved. */
    kXBARA1_InputLogicHigh          = 1|0x100U,    /**< LOGIC_HIGH output assigned to XBARA_IN1 input. */
    kXBARA1_InputIomuxXbarInout02   = 2|0x100U,    /**< IOMUX_XBAR_INOUT02 output assigned to XBARA_IN2 input. */
    kXBARA1_InputIomuxXbarInout03   = 3|0x100U,    /**< IOMUX_XBAR_INOUT03 output assigned to XBARA_IN3 input. */
    kXBARA1_InputFlexpwm1Pwm1OutTrig01 = 4|0x100U, /**< FLEXPWM1_PWM1_OUT_TRIG0_1 output assigned to XBARA_IN4 input. */
    kXBARA1_InputFlexpwm1Pwm2OutTrig01 = 5|0x100U, /**< FLEXPWM1_PWM2_OUT_TRIG0_1 output assigned to XBARA_IN5 input. */
    kXBARA1_InputFlexpwm1Pwm3OutTrig01 = 6|0x100U, /**< FLEXPWM1_PWM3_OUT_TRIG0_1 output assigned to XBARA_IN6 input. */
    kXBARA1_InputFlexpwm1Pwm4OutTrig01 = 7|0x100U, /**< FLEXPWM1_PWM4_OUT_TRIG0_1 output assigned to XBARA_IN7 input. */
    kXBARA1_InputPitTrigger0        = 8|0x100U,    /**< PIT_TRIGGER0 output assigned to XBARA_IN8 input. */
    kXBARA1_InputPitTrigger1        = 9|0x100U,    /**< PIT_TRIGGER1 output assigned to XBARA_IN9 input. */
    kXBARA1_InputPitTrigger2        = 10|0x100U,   /**< PIT_TRIGGER2 output assigned to XBARA_IN10 input. */
    kXBARA1_InputPitTrigger3        = 11|0x100U,   /**< PIT_TRIGGER3 output assigned to XBARA_IN11 input. */
    kXBARA1_InputDmaDone0           = 12|0x100U,   /**< DMA_DONE0 output assigned to XBARA_IN12 input. */
    kXBARA1_InputDmaDone1           = 13|0x100U,   /**< DMA_DONE1 output assigned to XBARA_IN13 input. */
    kXBARA1_InputDmaDone2           = 14|0x100U,   /**< DMA_DONE2 output assigned to XBARA_IN14 input. */
    kXBARA1_InputDmaDone3           = 15|0x100U,   /**< DMA_DONE3 output assigned to XBARA_IN15 input. */
    kXBARA1_InputDmaDone4           = 16|0x100U,   /**< DMA_DONE4 output assigned to XBARA_IN16 input. */
    kXBARA1_InputDmaDone5           = 17|0x100U,   /**< DMA_DONE5 output assigned to XBARA_IN17 input. */
    kXBARA1_InputDmaDone6           = 18|0x100U,   /**< DMA_DONE6 output assigned to XBARA_IN18 input. */
    kXBARA1_InputDmaDone7           = 19|0x100U,   /**< DMA_DONE7 output assigned to XBARA_IN19 input. */
    kXBARA1_InputAoi1Out0           = 20|0x100U,   /**< AOI1_OUT0 output assigned to XBARA_IN20 input. */
    kXBARA1_InputAoi1Out1           = 21|0x100U,   /**< AOI1_OUT1 output assigned to XBARA_IN21 input. */
    kXBARA1_InputAoi1Out2           = 22|0x100U,   /**< AOI1_OUT2 output assigned to XBARA_IN22 input. */
    kXBARA1_InputAoi1Out3           = 23|0x100U,   /**< AOI1_OUT3 output assigned to XBARA_IN23 input. */
    kXBARA1_InputAdcEtc0Coco0       = 24|0x100U,   /**< ADC_ETC0_COCO0 output assigned to XBARA_IN24 input. */
    kXBARA1_InputAdcEtc0Coco1       = 25|0x100U,   /**< ADC_ETC0_COCO1 output assigned to XBARA_IN25 input. */
    kXBARA1_InputAdcEtc0Coco2       = 26|0x100U,   /**< ADC_ETC0_COCO2 output assigned to XBARA_IN26 input. */
    kXBARA1_InputAdcEtc0Coco3       = 27|0x100U,   /**< ADC_ETC0_COCO3 output assigned to XBARA_IN27 input. */
} xbar_input_signal_t;

